task3_openfoam/channelwithstep/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0.5 0)
    (0.5 0.5 0)
    (0.5 1 0)
    (0 1 0)
    (0 0.5 0.1)
    (0.5 0.5 0.1)
    (0.5 1 0.1)
    (0 1 0.1)
    (5 0.5 0)
    (5 1 0)
    (5 0.5 0.1)
    (5 1 0.1)
    (0.5 0 0)
    (5 0 0)
    (0.5 0 0.1)
    (5 0 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (90 10 1) simpleGrading (1 1 1)
    hex (12 13 8 1 14 15 10 5) (90 10 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 11 10)
            (13 8 10 15)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (2 3 7 6)
            (2 9 11 6)
        );
    }
    lowerWall
    {
       type wall;
       faces
       (
            (0 1 5 4)
            (1 12 14 5)
            (12 13 15 14)
       );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (1 8 9 2)
            (5 10 11 6)
            (12 13 8 1)
            (14 15 10 5)
        );
    }
);


// ************************************************************************* //
