task3_openfoam/channelwithstep/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        //type            fixedValue;
        //value           uniform (1.0 0 0);
        type codedFixedValue;
        value uniform (1.0 0 0);

        name parabolicVelocity;
        code 
        #{
            const vectorField& Cf = patch().Cf();
            vectorField& field = *this;

            const scalar Umax = 1.0;
            forAll(Cf, faceI)
            {
                const scalar y = Cf[faceI][1];
                field[faceI] = vector(Umax*(1-(((y-0.75)/0.25)*((y-0.75)/0.25))),0,0);
            }
        #};
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            noSlip;
    }

    lowerWall
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
